# Generate automatically by build.py
# don`t change manually

class QIFLine:

   amount = 0.0 # Сумма
   date = datetime.now() # Дата проводки
   description = "" # Описание
   action = "" # Операция (для ценных бумаг): buy, sell. Для приведения к стандартным операциям используйте секцию [action]. Например [action] Покупка=buy
   securityname = "" # Имя ценной бумаги
   price = 0.0 # Цена (для ценных бумаг)
   quantity = 0.0 # Количество бумаг 
   commission = 0.0 # Комиссия (для ценных бумаг)


qifletters = {[',', ' ', "'", 'a', 'm', 'o', 'u', 'n', 't', "'", ':', ' ', "'", 'T', "'", ',', ' ', "'", 'd', 'a', 't', 'e', "'", ':', ' ', "'", 'D', "'", ',', ' ', "'", 'd', 'e', 's', 'c', 'r', 'i', 'p', 't', 'i', 'o', 'n', "'", ':', ' ', "'", 'P', "'", ',', ' ', "'", 'a', 'c', 't', 'i', 'o', 'n', "'", ':', ' ', "'", 'N', "'", ',', ' ', "'", 's', 'e', 'c', 'u', 'r', 'i', 't', 'y', 'n', 'a', 'm', 'e', "'", ':', ' ', "'", 'Y', "'", ',', ' ', "'", 'p', 'r', 'i', 'c', 'e', "'", ':', ' ', "'", 'I', "'", ',', ' ', "'", 'q', 'u', 'a', 'n', 't', 'i', 't', 'y', "'", ':', ' ', "'", 'Q', "'", ',', ' ', "'", 'c', 'o', 'm', 'm', 'i', 's', 's', 'i', 'o', 'n', "'", ':', ' ', "'", 'O', "'"]}